Revit 2026 API

# DocumentMakeTransientElements Method

---

This method encapsulates the process of creating transient elements in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MakeTransientElements(
	ITransientElementMaker maker
)
```
```vb
Public Sub MakeTransientElements (
	maker As ITransientElementMaker
)
```
```cpp
public:
void MakeTransientElements(
	ITransientElementMaker^ maker
)
```
```fsharp
member MakeTransientElements :
        maker : ITransientElementMaker -> unit
```

#### Parameters

maker ITransientElementMaker
     An instance of a class that implements the ITransientElementMaker interface. The maker will be called to create element(s) which would become transient.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This Document has an open editing transaction and is accepting changes. -or- This Document is read-only: It cannot be modified. |

The method establishes a context within which transient elements will be created and then invokes the given maker object to create the elements. For more information refer to the IsTransient method.

#### Reference

Document Class

Autodesk.Revit.DB Namespace